/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50621
Source Host           : localhost:3306
Source Database       : teach

Target Server Type    : MYSQL
Target Server Version : 50621
File Encoding         : 65001

Date: 2014-11-19 19:51:43
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for adminevent
-- ----------------------------
DROP TABLE IF EXISTS `adminevent`;
CREATE TABLE `adminevent` (
  `idx` int(11) NOT NULL AUTO_INCREMENT,
  `a_userid` varchar(50) NOT NULL,
  `a_event` varchar(50) NOT NULL,
  `a_ipaddress` varchar(50) NOT NULL,
  `a_datetime` datetime NOT NULL,
  PRIMARY KEY (`idx`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of adminevent
-- ----------------------------

-- ----------------------------
-- Table structure for adminfilter
-- ----------------------------
DROP TABLE IF EXISTS `adminfilter`;
CREATE TABLE `adminfilter` (
  `idx` int(11) NOT NULL AUTO_INCREMENT,
  `ipaddress` varchar(20) NOT NULL,
  `i_order` int(11) NOT NULL,
  `createtime` datetime NOT NULL,
  `updatetime` datetime NOT NULL,
  `deleteflag` int(11) NOT NULL,
  PRIMARY KEY (`idx`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of adminfilter
-- ----------------------------
INSERT INTO `adminfilter` VALUES ('1', '118.168.6.23', '0', '2014-11-13 11:28:53', '2014-11-13 11:28:53', '1');
INSERT INTO `adminfilter` VALUES ('2', '2.2.2.2', '0', '2014-11-13 11:33:25', '2014-11-13 11:33:25', '1');

-- ----------------------------
-- Table structure for adminuser
-- ----------------------------
DROP TABLE IF EXISTS `adminuser`;
CREATE TABLE `adminuser` (
  `a_idx` int(11) NOT NULL AUTO_INCREMENT,
  `a_userid` varchar(50) NOT NULL,
  `a_username` varchar(50) NOT NULL,
  `a_passwd` varchar(50) NOT NULL,
  `a_userphone` varchar(50) NOT NULL,
  `a_email` varchar(50) DEFAULT NULL,
  `admin` int(11) NOT NULL,
  `createtime` datetime NOT NULL,
  `updatetime` datetime NOT NULL,
  `deleteflag` int(11) NOT NULL,
  PRIMARY KEY (`a_idx`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of adminuser
-- ----------------------------
INSERT INTO `adminuser` VALUES ('1', 'admin', 'rocky', '1234', '0935952586', 'chentai008@yahoo.com', '1', '2014-10-06 06:47:51', '2014-10-06 06:47:56', '0');
INSERT INTO `adminuser` VALUES ('2', 'test', 'mary', '1234', '0955555555', 'chentai008@yahoo.com', '0', '2014-10-07 08:32:56', '2014-11-11 14:06:05', '0');
INSERT INTO `adminuser` VALUES ('3', '11111', '11111', '1234', '025555555', 'chentai008@yahoo.com', '0', '2014-11-11 14:02:42', '2014-11-11 14:02:50', '1');
INSERT INTO `adminuser` VALUES ('4', 'eeeee', 'ssssss', '1234', '027777777', 'chentai008@gmail.com', '0', '2014-11-06 17:16:21', '2014-11-10 14:44:13', '1');
INSERT INTO `adminuser` VALUES ('5', 'eee', 'eeee', '1234', '02444433', 'chentai008@yahoo.com', '0', '2014-11-06 17:26:57', '2014-11-10 14:44:17', '1');
INSERT INTO `adminuser` VALUES ('6', 'test2', 'test2', '1234', '0222222', 'chentai008@gmail.com', '0', '2014-11-10 14:43:18', '2014-11-11 14:05:44', '1');

-- ----------------------------
-- Table structure for contact_form
-- ----------------------------
DROP TABLE IF EXISTS `contact_form`;
CREATE TABLE `contact_form` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `identity` varchar(20) NOT NULL,
  `username` varchar(20) NOT NULL,
  `useremail` varchar(50) NOT NULL,
  `userphone` varchar(20) NOT NULL,
  `usermessage` text NOT NULL,
  `createtime` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of contact_form
-- ----------------------------

-- ----------------------------
-- Table structure for newslist
-- ----------------------------
DROP TABLE IF EXISTS `newslist`;
CREATE TABLE `newslist` (
  `n_id` int(11) NOT NULL AUTO_INCREMENT,
  `n_title` varchar(50) NOT NULL,
  `n_content` text NOT NULL,
  `n_date` date NOT NULL,
  `n_order` int(11) NOT NULL,
  `deleteflag` int(11) NOT NULL,
  `createtime` datetime NOT NULL,
  `updatetime` datetime NOT NULL,
  PRIMARY KEY (`n_id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of newslist
-- ----------------------------
INSERT INTO `newslist` VALUES ('1', '營利事業暫繳申報新措施，不可不知！', '本局表示，103年度營利事業所得稅暫繳申報自9月1日開始，今年新增2項便民措施說明如下，並呼籲營利事業儘早報繳。<br/>\r\n一、採網路申報者：新增附件上傳功能，免除營利事業遞交紙本附件之困擾。<br/>\r\n二、公司組織之營利事業，符合會計帳冊簿據完備，且使用藍色申報書或經會計師查核簽證，並如期辦理暫繳申報，得以103年度前6個月營利事業所得額試算暫繳稅額者：所試算之營利事業所得額屬來自中華民國境外、大陸地區或第三地區之所得，於當年度法定暫繳申報截止日前已依所得來源國稅法規定繳納之所得稅，得於規定限額內自暫繳稅額中扣抵，惟應提出所得來源國或地區稅務機關發給之納稅憑證，於取得指定或授權機構之驗(認)證後，併同暫繳稅額申報書及相關證明文件向稽徵機關辦理申報。<br/>\r\n　　本局呼籲營利事業儘速了解暫繳申報新措施，以維護自身權益。有關扣抵規定可至財政部賦稅署網站(網址http://www.dot.gov.tw)查閱相關法令。納稅義務人如有任何疑問，可撥打免費電話0800－000321，本局將竭誠為您服務。<br/>\r\n新聞稿聯絡人：審查一科　陳審核員<br/>\r\n聯絡電話：03-3396789轉1369<br/>\r\n龍王商號係龍三與王五共同組成的合夥營利事業，兩人的盈餘分配比率為50％：50％。假設龍王商號不合乎小規模營利事業查定課徵之規定（後詳），則民國104年度之盈餘應於105年（曆年制為5月份）自行辦理結算申報，而其結算之營利事業所得額為200萬元；並假設龍王商號於收取104年度利息收入時，曾經取得被扣繳所得稅4萬元之扣繳憑單。試問龍王商號與兩位合夥人應如何報繳所得稅？<br><br>財政部推動「財政健全方案」稅制調整措施之「所得稅法」修正案，業經立法院三讀通過，並於今（2014）年6月4日經總統公布。一般人認為與營利事業所得稅有關的主要修正內容，係將兩稅合一自「完全設算扣抵制」修改為「部分設算扣抵制」。但是部分設算扣抵主要係針對公司組織的個人股東和合作社的個人社員，將其可扣抵稅額減半，亦即在所得稅法第66條之6「股東（或社員）可扣抵稅額＝股利（或盈餘）淨額 × 稅額扣抵比率。」之後增加但書規定「但中華民國境內居住之個人股東（或社員）之可扣抵稅額＝股利（或盈餘）淨額 × 稅額扣抵比率 × 百分之五十。」；對於獨資、合夥則另有其相關的重要修正條文，本文將利用兩個釋例來闡述這次稅制變動對獨資、合夥（及其資本主、合夥人）與小規模營利事業的稅務影響。<br><br>釋例一：合夥事業之所得稅申報<br>\r\n龍王商號係龍三與王五共同組成的合夥營利事業，兩人的盈餘分配比率為50％：50％。假設龍王商號不合乎小規模營利事業查定課徵之規定（後詳），則民國104年度之盈餘應於105年（曆年制為5月份）自行辦理結算申報，而其結算之營利事業所得額為200萬元；並假設龍王商號於收取104年度利息收入時，曾經取得被扣繳所得稅4萬元之扣繳憑單。試問龍王商號與兩位合夥人應如何報繳所得稅？<br><br>財政部推動「財政健全方案」稅制調整措施之「所得稅法」修正案，業經立法院三讀通過，並於今（2014）年6月4日經總統公布。一般人認為與營利事業所得稅有關的主要修正內容，係將兩稅合一自「完全設算扣抵制」修改為「部分設算扣抵制」。但是部分設算扣抵主要係針對公司組織的個人股東和合作社的個人社員，將其可扣抵稅額減半，亦即在所得稅法第66條之6「股東（或社員）可扣抵稅額＝股利（或盈餘）淨額 × 稅額扣抵比率。」之後增加但書規定「但中華民國境內居住之個人股東（或社員）之可扣抵稅額＝股利（或盈餘）淨額 × 稅額扣抵比率 × 百分之五十。」；對於獨資、合夥則另有其相關的重要修正條文，本文將利用兩個釋例來闡述這次稅制變動對獨資、合夥（及其資本主、合夥人）與小規模營利事業的稅務影響。<br><br>釋例一：合夥事業之所得稅申報<br>\r\n龍王商號係龍三與王五共同組成的合夥營利事業，兩人的盈餘分配比率為50％：50％。假設龍王商號不合乎小規模營利事業查定課徵之規定（後詳），則民國104年度之盈餘應於105年（曆年制為5月份）自行辦理結算申報，而其結算之營利事業所得額為200萬元；並假設龍王商號於收取104年度利息收入時，曾經取得被扣繳所得稅4萬元之扣繳憑單。試問龍王商號與兩位合夥人應如何報繳所得稅？<br>\r', '2014-10-17', '1', '0', '2014-10-15 06:59:29', '2014-10-15 06:59:32');
INSERT INTO `newslist` VALUES ('2', '為有效防止獎金被冒（詐）領，國稅局針對異常中獎案件查核！', '本局表示，購物消費索取統一發票，已成為民眾生活習慣，而統一發票對獎變成全民運動，然為防止不肖業者或民眾以不正當方法套取或冒（詐）領獎金，並確保獎金發放之公正性，異常中獎之統一發票查核機制為國稅局必查之業務。<br/>\r\n　　本局說明，利用統一發票套取或冒(詐)領獎金情形多為：以偽造或變造之發票詐領獎金、營業人銷售貨物或勞務時，未依規定開立發票，事後開立不實之統一發票，且將該發票占為己有冒領獎金；營業人或其所僱用之人開立發票不(未)交付買受人，占為己有涉嫌冒領獎金等。依統一發票給獎辦法第15條規定，以不正當方法套取或冒(詐)領獎金者，應追回其獎金，主管稽徵機關並於取得相關不法事證後，移送司法機關究辦。<br/>\r\n　　本局進一步說明，曾有4位民眾同一期分別兌中13-16張不等之統一發票，但是兌中的統一發票卻都是同一家營業人所開出顯有異常；本局於是展開調查，開出發票之營業人屬經營有線電視業者，已舉證中獎統一發票皆主動寄送客戶，惟查4位中獎民眾戶籍地皆相同，具親屬關係，且都拒到案說明，本局初步研判該中獎統一發票於委託民間郵局寄送時遭他人占為己有，遂將相關不法事證移送檢調機關究責。檢察官經偵查終結，係任職於民間郵局之職員將其應投遞之統一發票，佔用並交付家人兌領獎金，冒領獎金民眾皆坦承不諱，遂以侵占罪嫌緩起訴處分，並責令渠等應向國庫支付緩起訴處分金。<br/>\r\n　　本局強調，自100年起統一發票開出特別獎1,000萬元獎金，已創造了166位千萬富翁；千萬大獎的確提高民眾購物消費索取統一發票之誘因，但為防止冒(詐)領統一發票中獎獎金情形國稅局亦會主動加強查核。<br/>\r\n　　本局特別呼籲民眾，千萬勿因貪小便宜或存有僥倖心理而冒（詐）領獎金，如經查核有不法情事，除追回已領獎金外，有偽變造中獎發票等重大情節者，並將移送法辦。\r\n新聞稿聯絡人：審查四科　鄭股長<br/>\r\n聯絡電話：03-3396789轉1233<br/>', '2014-10-17', '2', '0', '2014-10-17 02:42:26', '2014-10-17 02:42:32');
INSERT INTO `newslist` VALUES ('3', '繳納二代健保補充保費，可於繳納年度之綜合所得稅申報列舉扣除', '本局表示，依所得稅法第17條第1項第2款第2目之2規定，納稅義務人本人、配偶及直系親屬之人身保險、勞工保險及軍、公、教保險之保險費，每人每年扣除數額以不超過2萬4千元為限。但全民健康保險之保險費不受金額限制。二代健保實施後，個人依全民健康保險法規定繳納之補充保險費仍屬健保費，依上開規定，可於繳納年度之綜合所得稅申報保險費全數列舉扣除，不受每年每人2萬4千元的限制。<br/>　　本局特別說明，納稅義務人辦理綜合所得稅結算申報時若選擇採用列舉扣除額，關於保險費項目，首先要符合被保險人與要保人在同一申報戶內。保險費可以分為二部分計算：（1）健保費支出：納稅義務人本人、配偶及申報受扶養直系親屬每人全年健保費由納稅義務人、合併申報的配偶或受扶養親屬繳納者，全部都可以列報扣除，沒有金額的限制；（2）其他保險費支出：納稅義務人本人、配偶或申報受扶養直系親屬人身保險之保險費（含國民年金保險、就業保險、勞工保險、軍公教保險、農保及學生平安保險），每一被保險人每年扣除數額以不超過2萬4千元為限。<br/>　　民眾如有不明瞭之處，歡迎利用本局免費服務電話0800-000321或上本局網站(網址為http://www.ntbna.gov.tw)點選網頁電話詢問，本局將竭誠提供諮詢服務。新聞稿聯絡人：審查二科　廖股長<br/>聯絡電話：03-3396789轉1436<br/>', '2014-10-17', '3', '0', '2014-10-17 02:45:40', '2014-11-11 14:12:28');
INSERT INTO `newslist` VALUES ('4', '預售屋買賣賺取差價屬財產交易所得，應申報綜合所得稅', '本局表示，個人購買預售屋在尚未取得該預售屋（含土地）所有權前出售，係屬「權利」移轉，非屬「不動產」產權移轉，依所得稅法規定，應以交易時之成交價額減除原始取得成本及相關必要費用之餘額為財產交易所得，申報綜合所得稅。<br/>　　本局指出，近年來因部分縣市合併升格為直轄市，造成繁榮地段紛紛推出高科技多功能的高價豪宅，由於預售屋僅需預繳小額訂金，有不少投資客以買賣預售屋賺取高額利潤。　　為維護租稅公平，查核預售屋及鉅額房地交易案件已列為今年度財政部專案查核重點項目，除透過建商、代銷商、房屋買賣仲介業、各縣市政府、網路、報載等管道蒐集資料，並調查相關資金流程查核交易情形，以遏止刻意炒作賺取差價而漏未申報納稅的情事。<br/>　　本局並說明，本局所屬各分局、稽徵所於進行查核前，均會先行發函輔導民眾自行檢視是否已就上開交易所得申報所得稅，請尚未申報民眾依限補報而免予處罰，並提醒民眾應提示買賣契約書、讓渡書及收支憑證，以憑正確計算財產交易所得；民眾如已自行申報，於接獲輔導函後，亦請撥空與本局聯繫，本局將協助查對原申報資料是否正確，如有差額亦可即時補報。<br/>　　本局同時提醒，以前年度如有是類所得而未申報之民眾，在稽徵機關尚未調查或未經他人檢舉前，應儘速向戶籍所在地稽徵機關自動補報補繳及加計利息，否則一經查獲，除須補稅外還要受罰。<br/>新聞稿聯絡人：審查二科廖股長<br/>聯絡電話：03-3396789轉1436<br/>', '2014-10-17', '4', '0', '2014-10-17 02:48:22', '2014-11-11 14:12:21');
INSERT INTO `newslist` VALUES ('5', 'test', 'test', '2014-11-11', '0', '1', '2014-11-11 11:56:31', '2014-11-11 15:08:47');
INSERT INTO `newslist` VALUES ('6', 'test2', 'dddddd', '2014-11-20', '5', '0', '2014-11-11 15:08:16', '2014-11-11 15:09:57');
INSERT INTO `newslist` VALUES ('7', 'test3', 'test3', '2014-11-27', '0', '1', '2014-11-11 15:07:19', '2014-11-11 15:07:41');
